app/controllers/users_controller.rb

INSERT INTO "users" ("email", "login", "remember_token", "created_at", "activation_code", "activated_at", "name", "remember_token_expires_at", "updated_at", "salt", "crypted_password", "reset_code") VALUES ('ealin@hey-go.com', 'ealin2', NULL, '2011-01-29 15:35:00.000924', '84281821cbec82b6913048c05707cc13529384e0', NULL, '', NULL, '2011-01-29 15:35:00.000924', '10a8039bc714a0de3f41a0ab0ecb9af590fd0489', 'ac816b98c5493bfdbc9b21f0c27ffb3fb930810c', NULL)
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save

SELECT "users".* FROM "users" WHERE ("users"."activation_code" = '6d3cb0264433605bb89d99f7b50f8c96362f3bb2') LIMIT 1
---
  def activate
    logout_keeping_session!
    user = User.find_by_activation_code(params[:activation_code]) unless params[:activation_code].blank?

SELECT "users".* FROM "users" WHERE ("users"."email" = 'ealin.chiu@gmail.com') LIMIT 1
---
 def forgot
  if request.post?
    user = User.find_by_email(params[:user][:email])

SELECT "users".* FROM "users" WHERE ("users"."reset_code" = 'c0d2541171144304a8d9a87a7950d2a183d0a01b') LIMIT 1
---
def reset
  @user = User.find_by_reset_code(params[:reset_code]) unless params[:reset_code].nil?